{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA0_i",
   "name" : "int[0]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA0_i",
   "source_file" : "system/core/libcutils/include/cutils/native_handle.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIa",
   "name" : "signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIa",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIf",
   "name" : "float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIf",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIt",

   "self_type" : "_ZTIP9fs_config",
   "size" : 4,
   "source_file" : "system/core/libcutils/include/private/fs_config.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP9str_parms",
   "name" : "str_parms *",
   "referenced_type" : "_ZTI9str_parms",
   "self_type" : "_ZTIP9str_parms",
   "size" : 4,
   "source_file" : "system/core/libcutils/include/cutils/str_parms.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFbPvS_E",
   "name" : "bool (*)(void *, void *)",
   "referenced_type" : "_ZTIFbPvS_E",
   "self_type" : "_ZTIPFbPvS_E",
   "size" : 4,
   "source_file" : "system/core/libcutils/include/cutils/hashmap.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFbPvS_S_E",
   "name" : "bool (*)(void *, void *, void *)",
   "referenced_type" : "_ZTIFbPvS_S_E",
   "self_type" : "_ZTIPFbPvS_S_E",
   "size" : 4,
   "source_file" : "system/core/libcutils/include/cutils/hashmap.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFiPvE",
   "name" : "int (*)(void *)",
   "referenced_type" : "_ZTIFiPvE",
   "self_type" : "_ZTIPFiPvE",
   "size" : 4,
   "source_file" : "system/core/libcutils/include/cutils/hashmap.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvPKcS0_PvE",
   "name" : "void (*)(const char *, const char *, void *)",
   "referenced_type" : "_ZTIFvPKcS0_PvE",
   "self_type" : "_ZTIPFvPKcS0_PvE",
   "size" : 4,
   "source_file" : "system/core/libcutils/include/cutils/properties.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK13native_handle",
   "name" : "const native_handle *",
   "referenced_type" : "_ZTIK13native_handle",
   "self_type" : "_ZTIPK13native_handle",
   "size" : 4,
   "source_file" : "system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK22cutils_socket_buffer_t",
   "name" : "const cutils_socket_buffer_t *",
   "referenced_type" : "_ZTIK22cutils_socket_buffer_t",
   "self_type" : "_ZTIPK22cutils_socket_buffer_t",
   "size" : 4,
   "source_file" : "system/core/libcutils/include/cutils/sockets.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK5iovec",
   "name" : "const iovec *",
   "referenced_type" : "_ZTIK5iovec",
   "self_type" : "_ZTIPK5iovec",
   "size" : 4,
   "source_file" : "system/core/libcutils/include/cutils/klog.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 4,
   "source_file" : "system/core/libcutils/include/cutils/config_utils.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 4,
   "source_file" : "system/core/libcutils/include/cutils/sockets.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPv",
   "name" : "void **",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIPPv",
   "size" : 4,
   "source_file" : "system/core/libcutils/include/cutils/record_stream.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 4,
   "source_file" : "system/core/libcutils/include/cutils/config_utils.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPf",
   "name" : "float *",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIPf",
   "size" : 4,
   "source_file" : "system/core/libcutils/include/cutils/str_parms.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPi",
   "name" : "int *",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIPi",
   "size" : 4,
   "source_file" : "system/core/libcutils/include/cutils/iosched_policy.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 4,
   "source_file" : "system/core/libcutils/include/cutils/misc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "system/core/libcutils/include/cutils/misc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPy",
   "name" : "unsigned long long *",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIPy",
   "size" : 4,
   "source_file" : "system/core/libcutils/include/private/canned_fs_config.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13native_handle",
   "name" : "const native_handle",
   "referenced_type" : "_ZTI13native_handle",
   "self_type" : "_ZTIK13native_handle",
   "size" : 12,
   "source_file" : "system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK22cutils_socket_buffer_t",
   "name" : "const cutils_socket_buffer_t",
   "referenced_type" : "_ZTI22cutils_socket_buffer_t",
   "self_type" : "_ZTIK22cutils_socket_buffer_t",
   "size" : 8,
   "source_file" : "system/core/libcutils/include/cutils/sockets.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK5iovec",
   "name" : "const iovec",
   "referenced_type" : "_ZTI5iovec",
   "self_type" : "_ZTIK5iovec",
   "size" : 8,
   "source_file" : "system/core/libcutils/include/cutils/klog.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "system/core/libcutils/include/cutils/config_utils.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "system/core/libcutils/include/cutils/sockets.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA0_i"
    }
   ],
   "linker_set_key" : "_ZTI13native_handle",
   "name" : "native_handle",
   "referenced_type" : "_ZTI13native_handle",
   "self_type" : "_ZTI13native_handle",
   "size" : 12,
   "source_file" : "system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "length",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI22cutils_socket_buffer_t",
   "name" : "cutils_socket_buffer_t",
   "referenced_type" : "_ZTI22cutils_socket_buffer_t",
   "self_type" : "_ZTI22cutils_socket_buffer_t",
   "size" : 8,
   "source_file" : "system/core/libcutils/include/cutils/sockets.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIP5cnode"
    },
    {
     "field_name" : "first_child",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP5cnode"
    },
    {
     "field_name" : "last_child",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP5cnode"
    },
    {
     "field_name" : "name",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "value",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI5cnode",
   "name" : "cnode",
   "referenced_type" : "_ZTI5cnode",
   "self_type" : "_ZTI5cnode",
   "size" : 20,
   "source_file" : "system/core/libcutils/include/cutils/config_utils.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uid",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mode",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "capabilities",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI9fs_config",
   "name" : "fs_config",
   "referenced_type" : "_ZTI9fs_config",
   "self_type" : "_ZTI9fs_config",
   "size" : 24,
   "source_file" : "system/core/libcutils/include/private/fs_config.h"
  }
 ],
 "rvalue_reference_types" : []
}
